#include <stdio.h>

int countWays(int n) {
    // Базовий випадок: якщо кількість осіб менша за 3, неможливо обрати президію
    if (n < 3) {
        return 0;
    }
    // Базовий випадок: якщо кількість осіб дорівнює 3, є лише 1 спосіб вибрати президію
    if (n == 3) {
        return 1;
    }
    // Рекурсивний випадок: обчислюємо кількість способів з урахуванням вибору або невибору поточної особи
    return countWays(n - 1) + countWays(n - 2) + countWays(n - 3);
}

int main() {
    int n = 30;
    int ways = countWays(n);

    printf("Кількість способів обрати президію зборів із %d осіб: %d\n", n, ways);

    return 0;
}
